casainho/ML_predict_target_board_RGB_LED_state-ESP32-S3_CircuitPython/machine_learning_board_firmware/main.c
  char* ptr = result, *ptr1 = result, tmp_char;
  int tmp_value;

  do {
    tmp_value = value;
    value /= base;
    *ptr++ = "zyxwvutsrqponmlkjihgfedcba9876543210123456789abcdefghijklmnopqrstuvwxyz" [35 + (tmp_value - value * base)];
  } while ( value );

  // Apply negative sign
  if (tmp_value < 0) *ptr++ = '-';
  *ptr-- = '\0';
  while(ptr1 < ptr) {
    tmp_char = *ptr;
    *ptr--= *ptr1;
    *ptr1++ = tmp_char;
  }
  return result;
}

void timer_handler(nrf_timer_event_t event_type, void* p_context)
{

}

#define SAADC_SAMPLES_IN_BUFFER         1 //4
#define SAADC_SAMPLE_RATE               10000 // in us 

static const nrf_drv_timer_t   m_timer = NRF_DRV_TIMER_INSTANCE(3);
static nrf_saadc_value_t       m_buffer_pool[2][SAADC_SAMPLES_IN_BUFFER];
static nrf_ppi_channel_t       m_ppi_channel;

void saadc_sampling_event_init(void)
{
  ret_code_t err_code;
  err_code = nrf_drv_ppi_init();
  APP_ERROR_CHECK(err_code);
  
  nrf_drv_timer_config_t timer_config = NRF_DRV_TIMER_DEFAULT_CONFIG;
  timer_config.frequency = NRF_TIMER_FREQ_31250Hz;
  err_code = nrf_drv_timer_init(&m_timer, &timer_config, timer_handler);
  APP_ERROR_CHECK(err_code);

  /* setup m_timer for compare event */
  uint32_t ticks = nrf_drv_timer_us_to_ticks(&m_timer, SAADC_SAMPLE_RATE);
  nrf_drv_timer_extended_compare(&m_timer, NRF_TIMER_CC_CHANNEL0, ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, false);
  nrf_drv_timer_enable(&m_timer);

  uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer, NRF_TIMER_CC_CHANNEL0);
  uint32_t saadc_sample_event_addr = nrf_drv_saadc_sample_task_get();

  /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
  err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
  APP_ERROR_CHECK(err_code);
  
  err_code = nrf_drv_ppi_channel_assign(m_ppi_channel, timer_compare_event_addr, saadc_sample_event_addr);
  APP_ERROR_CHECK(err_code);
}

void saadc_sampling_event_enable(void)
{
  ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
  APP_ERROR_CHECK(err_code);
}

uint16_t ui16_m_adc_value;

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
  if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
  {
    // set buffers
    ret_code_t err_code;
    err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAADC_SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    uint8_t ui8_array[20];
    uint16_t ui16_value;
    uint16_t ui16_len = 0;
    static uint8_t ui8_counter = 0;
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) 
    { 
      ui16_value = p_event->data.done.p_buffer[0];

      if (ui8_counter == 0) {
        ui8_array[ui16_len] = '[';
        ui16_len++;
      }
        
      itoa(ui16_value, (char*) (ui8_array + ui16_len), 10);

      if (ui16_value < 10)
        ui16_len += 1;
      else if (ui16_value < 100)
        ui16_len += 2;
      else if (ui16_value < 1000)
        ui16_len += 3;
      else if (ui16_value < 10000)
        ui16_len += 4;
      else if (ui16_value < 100000)
        ui16_len += 5;

      ui8_array[ui16_len] = ',';
      ui16_len++;

      ui8_counter++;
      if (ui8_counter >= 16) {
        ui8_counter = 0;
        ui8_array[ui16_len - 1] = ']';
        ui8_array[ui16_len] = '\n';
        ui16_len++;
      }

      err_code = ble_nus_data_send(&m_nus, ui8_array, &ui16_len, m_conn_handle);
      if (err_code == NRF_SUCCESS)
      {

      }
    }
  }
}

void saadc_init(void)
{
  ret_code_t err_code;

  nrf_drv_saadc_config_t saadc_config = NRF_DRV_SAADC_DEFAULT_CONFIG;
  saadc_config.resolution = NRF_SAADC_RESOLUTION_12BIT;

  nrf_saadc_channel_config_t channel_0_config =
      NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);
  channel_0_config.reference = SAADC_CH_CONFIG_REFSEL_VDD1_4;
  channel_0_config.gain = SAADC_CH_CONFIG_GAIN_Gain4;

  err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
  APP_ERROR_CHECK(err_code);

  err_code = nrf_drv_saadc_channel_init(0, &channel_0_config);
  APP_ERROR_CHECK(err_code);

  err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0],SAADC_SAMPLES_IN_BUFFER);
  APP_ERROR_CHECK(err_code);   
  err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1],SAADC_SAMPLES_IN_BUFFER);
  APP_ERROR_CHECK(err_code);
}

int main(void)
{
  timers_init();
  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();
  peer_manager_init();
  advertising_start(true);

  saadc_sampling_event_init();
  saadc_init();
  saadc_sampling_event_enable();

  // Enter main loop.
  for (;;)
  {
    idle_state_handle();
  }
}
